kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick.
   */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM6_Init();
  MX_DAC1_Init();
  MX_TIM2_Init();
  MX_I2C2_Init();
  MX_SPI1_Init();
  /* USER CODE BEGIN 2 */

  //---------------------------------------------------------------------------//
  // Main loop
  //---------------------------------------------------------------------------//

  /* USER CODE END 2 */

  /* Initialize COM1 port (115200, 8 bits (7-bit data + 1 stop bit), no parity
   */
  BspCOMInit.BaudRate = 115200;
  BspCOMInit.WordLength = COM_WORDLENGTH_8B;
  BspCOMInit.StopBits = COM_STOPBITS_1;
  BspCOMInit.Parity = COM_PARITY_NONE;
  BspCOMInit.HwFlowCtl = COM_HWCONTROL_NONE;
  if (BSP_COM_Init(COM1, &BspCOMInit) != BSP_ERROR_NONE) {
    Error_Handler();
  }

  /* USER CODE BEGIN BSP */

  /* -- Sample board code to send message over COM1 port ---- */
  printf("\033[2J\033[H");
  printf("-------------------------\r\n");
  printf("Hello from VCP!\r\n");

  /* USER CODE END BSP */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  //-----------------------------------------------------------------------------//
  // Prepare sine wave lookup tables
  //-----------------------------------------------------------------------------//

  get_sineval_low();
  get_sineval_high();
  get_dc_mid();

  //-----------------------------------------------------------------------------//
  // Set DAC output to mid-level (silence) before starting
  //-----------------------------------------------------------------------------//

  Set_DAC_Output_To_Midlevel();

  //-----------------------------------------------------------------------------//
  // Initialize RTC
  //-----------------------------------------------------------------------------//

  // DS3231_PowerOn();
  // if (HAL_I2C_IsDeviceReady(&hi2c2, DS3231_ADDR, 3, 100) == HAL_OK) {
  //   DS3231_Init();
  //   Set_Time(INITIAL_SEC, INITIAL_MIN, INITIAL_HOUR, INITIAL_DOW,
  //   INITIAL_DOM,
  //            INITIAL_MONTH, INITIAL_YEAR);
  // }
  // Get_Time(&now);
  // printf("-------------------------\r\n");

  printf("-------------------------\r\n");

  printf("-------------------------\r\n");

  init_radio(RX);

  printf("--------------------------\r\n");

  printf("Entering main loop...\r\n");

  while (1) {

    // 1) Enter STOP mode and wait for wakeup from EXTI (GPIOA Pin 1)
    printf("Entering STOP mode...\r\n");
    EnterStopMode();

    // 2) Debounce button
    while (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_RESET) {
    }
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_1);

    printf("Woke up!\r\n");

    // 3) Check state and either start RX or TX
    if (RX) {
      // RX mode: read from radio and store in string
      read_RX(transmission, sizeof(transmission));
      printf("Received transmission: ");
      for (size_t i = 0; i < sizeof(transmission); i++) {
        printf("%02X ", transmission[i]);
      }
      printf("\r\n");

      // Process received transmission (e.g. parse bytes, convert RSSI to dBm,
      // etc.)
      process_transmission(transmission, &dBm_value);

      printf("Processed transmission into %s\r\n", transmission);
      printf("dBm value: %d\r\n", dBm_value);

      // Create output string based on received data and dBm value (e.g.
      // "/STR.../DID.../LOC.../TMP.../TIM...")
      char output_str[256] = {0};
      create_string_from_received_data(transmission, dBm_value, output_str,
                                       sizeof(output_str));

      printf("Final output string: %s\r\n", output_str);

      // Make bitstream from output string
      make_bitstream_from_string(output_str);
      printf("Prepared bitstream from output string.\r\n");
      printf("Output string length: %d characters\r\n",
             (int)strlen(output_str));

      // Calculate active duration based on bitstream length and bit durations
      size_t bitstream_len = strlen(output_str) * 8u;
      calculate_active_duration_ms(bitstream_len);
      uint32_t total_ms = (uint32_t)(total_time * 1000.0f);
      printf("Calculated active duration for response: %lu ms\r\n",
             (unsigned long)total_ms);

      // Send transmission over audio
      printf("Starting transmission of response over audio...\r\n");
      TX_Start();

      // Wait for active window to complete (enters low-power sleep while
      // waiting)
      StartActiveWindowMs((uint32_t)(total_time * 1000.0f));
      while (!active_done) {
        __WFI(); // CPU sleeps while DMA+TIM2+DAC run
      }
      active_done = 0;

      // Stop transmission and go back to sleep
      TX_Stop();

    } else {
      // Send transmission over radio
      printf("Starting transmission over radio...\r\n");
      start_TX();
    }

    printf("Going back to sleep...\r\n");

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
   */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV1;
  RCC_OscInitStruct.PLL.PLLN = 8;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

