kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  printf("  TX stopped cleanly (DAC set to mid)\r\n");
}

void Set_DAC_Output_To_Midlevel(void) {
  CLEAR_BIT(DAC1->CR, DAC_CR_TEN1);

  // Ensure DAC channel is enabled
  HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);

  // Set mid-scale (12-bit right aligned)
  HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dc_mid[0]);
}

void string_to_hex(const char *str, uint8_t *hex_buf, size_t hex_buf_size) {
  size_t str_len = strlen(str);
  size_t max_bytes =
      (hex_buf_size < (str_len / 2)) ? hex_buf_size : (str_len / 2);

  for (size_t i = 0; i < max_bytes; i++) {
    sscanf(&str[i * 2], "%2hhx", &hex_buf[i]);
  }
}

void process_transmission(const uint8_t *transmission, int *dBm_value) {
  size_t len = strlen((const char *)transmission);
  if (len <= 4) {
    printf("Transmission too short to process.\r\n");
    return;
  }

  for (size_t i = 0; i < len; i++) {
    printf("%02X ", transmission[i]);
  }
  printf("\r\n");

  uint8_t rssi_hex = transmission[len - 2]; // 2nd from end

  // printf("Extracted RSSI hex: %02X\r\n", rssi_hex);

  int8_t rssi_signed = (int8_t)rssi_hex; // 2's complement

  // printf("RSSI signed value: %d\r\n", rssi_signed);

  int rssi_dbm = (rssi_signed / 2) - 74; // integer dBm

  // printf("RSSI: %d dBm\r\n", rssi_dbm);

  dBm_value[0] = (int)rssi_dbm;

  // Create cleaned string: skip first 2 char, skip last 2 chars
  size_t cleaned_len = (len > 4) ? (len - 4) : 0;
  char cleaned_str[MAX_NUM_CHARS] = {0};
  if (cleaned_len > 0) {
    strncpy(cleaned_str, (const char *)transmission + 2, cleaned_len);
    cleaned_str[cleaned_len] = '\0'; // Null-terminate
  }

  // Overwrite the transmission parameter (cast needed for const)
  strncpy((char *)transmission, cleaned_str, MAX_NUM_CHARS - 1);
}

void create_string_from_received_data(const uint8_t *transmission,
                                      int dBm_value, char *output_str,
                                      size_t output_str_size) {
  if (!output_str || output_str_size == 0)
    return;

  // Clear the entire output string buffer to ensure no leftover data, and set
  // first char to null for safe concatenation
  memset(output_str, 0, output_str_size);
  output_str[0] = '\0';

  // Initialize with default values
  char user_string[64] = USER_STRING; // fallback from user_config.h
  int device_id = DEVICE_ID;          // fallback from user_config.h
  char location[64] = LOCATION;       // fallback from user_config.h
  int temperature = temp_int;         // runtime value
  rtc_time_t time_val = now;          // runtime value

  // Copy transmission to local buffer for tokenization
  char buf[256];
  size_t in_len = strnlen((const char *)transmission, sizeof(buf) - 1);
  memcpy(buf, transmission, in_len);
  buf[in_len] = '\0';

  // Parse tokens in the format /KEYvalue, where KEY is 3 chars and value is
  // variable length, separated by '/'
  for (char *tok = strtok(buf, "/"); tok != NULL; tok = strtok(NULL, "/")) {

    if (strncmp(tok, "STR", 3) == 0) {
      strncpy(user_string, tok + 3, sizeof(user_string) - 1);
      user_string[sizeof(user_string) - 1] = '\0';

    } else if (strncmp(tok, "DID", 3) == 0) {
      device_id = atoi(tok + 3);

    } else if (strncmp(tok, "LOC", 3) == 0) {
      strncpy(location, tok + 3, sizeof(location) - 1);
      location[sizeof(location) - 1] = '\0';

    } else if (strncmp(tok, "TMP", 3) == 0) {
      temperature = atoi(tok + 3);

    } else if (strncmp(tok, "TIM", 3) == 0) {
      const char *p = tok + 3;
      if (strlen(p) >= 14) {
        char t[3] = {0};

        t[0] = p[0];
        t[1] = p[1];
        time_val.hours = (uint8_t)atoi(t);
        t[0] = p[2];
        t[1] = p[3];
        time_val.minutes = (uint8_t)atoi(t);
        t[0] = p[4];
        t[1] = p[5];
        time_val.seconds = (uint8_t)atoi(t);
        t[0] = p[6];
        t[1] = p[7];
        time_val.day = (uint8_t)atoi(t);
        t[0] = p[8];
        t[1] = p[9];
        time_val.date = (uint8_t)atoi(t);
        t[0] = p[10];
        t[1] = p[11];
        time_val.month = (uint8_t)atoi(t);

        char y[5] = {p[12], p[13], p[14], p[15], 0};
        time_val.year = (uint16_t)atoi(y);
      }
    }
  }

  // Build output string based on parsed tokens and compile-time flags, with
  // careful buffer management
  size_t offset = 0;
  size_t remaining = output_str_size;
  int n = 0;

  output_str[0] = '\0';

  if (INCLUDE_USER_STRING) {
    n = snprintf(&output_str[offset], remaining, "/STR%s", user_string);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_DEVICE_ID) {
    n = snprintf(&output_str[offset], remaining, "%s/DID%d",
                 (offset > 0) ? "" : "", device_id);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_LOCATION) {
    n = snprintf(&output_str[offset], remaining, "%s/LOC%s",
                 (offset > 0) ? "" : "", location);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_TEMPERATURE) {
    n = snprintf(&output_str[offset], remaining, "%s/TMP%d",
                 (offset > 0) ? "" : "", temperature);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_TIME) {
    n = snprintf(&output_str[offset], remaining,
                 "%s/TIM%02d%02d%02d%02d%02d%02d%04d", (offset > 0) ? "" : "",
                 time_val.hours, time_val.minutes, time_val.seconds,
                 time_val.day, time_val.date, time_val.month, time_val.year);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  // Add termination slash
  if (strlen(output_str) > 0) {
    n = snprintf(&output_str[offset], remaining, "/");
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  // Optional: append RSSI info for debug/logging
  // snprintf(&output_str[offset], remaining, " RSSI=%d dBm", dBm_value);

  // Hard guarantee null-termination
  output_str[output_str_size - 1] = '\0';
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
